doc/xml/OTA_HotelResNotifRQ.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Header>
        <wsse:Security mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>username</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </s:Header>
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <OTA_HotelResNotifRQ EchoToken="e7ddd754-a4b0-4a39-9f03-8fccff0c87bf" TimeStamp="2019-04-09T18:22:54+0800" Version="1" ResStatus="Commit" xmlns="http://www.opentravel.org/OTA/2003/05">
            <POS>
                <Source>
                    <RequestorID Type="22" ID="{POS_ID}"/>
                    <BookingChannel Primary="true">
                        <CompanyName Code="{POS_CODE}">{POS_NAME}</CompanyName>
                    </BookingChannel>
                </Source>
            </POS>
            <HotelReservations>
                <HotelReservation CreateDateTime="2019-04-09T18:22:54+0700">
                    <UniqueID Type="14" ID="{RESERVATION_ID}"/>
                    <RoomStays>
                        <RoomStay>
                            <RoomTypes>
                                <RoomType RoomTypeCode="{ROOM_CODE}">
                                    <RoomDescription Name="{ROOM_NAME}"/>
                                </RoomType>
                            </RoomTypes>
                            <RatePlans>
                                <RatePlan RatePlanCode="{RATE_CODE}">
                                    <RatePlanDescription Name="{RATE_NAME}">
                                        <Text>{RATE_NAME}</Text>
                                    </RatePlanDescription>
                                </RatePlan>
                            </RatePlans>
                            <RoomRates>
                                <RoomRate RatePlanCode="{RATE_CODE}" RoomTypeCode="{ROOM_CODE}" NumberOfUnits="1">
                                    <Rates>
                                        <Rate UnitMultiplier="1" ExpireDate="2019-04-16" EffectiveDate="2019-04-14">
                                            <Base AmountAfterTax="500" CurrencyCode="THB"/>
                                            <Total AmountAfterTax="500" CurrencyCode="THB"/>
                                        </Rate>
                                    </Rates>
                                </RoomRate>
                            </RoomRates>
                            <GuestCounts>
                                <GuestCount AgeQualifyingCode="10" Count="2"/>
                            </GuestCounts>
                            <TimeSpan Start="2019-04-14" End="2019-04-16"/>
                            <Total AmountAfterTax="500" CurrencyCode="THB"/>
                            <BasicPropertyInfo HotelName="{HOTEL_NAME}" HotelCode="{HOTEL_CODE}"/>
                            <ResGuestRPHs>
                                <ResGuestRPH RPH="1"/>
                                <ResGuestRPH RPH="2"/>
                            </ResGuestRPHs>
                        </RoomStay>
                        <RoomStay>
                            <RoomTypes>
                                <RoomType RoomTypeCode="{ROOM_CODE}">
                                    <RoomDescription Name="{ROOM_NAME}"/>
                                </RoomType>
                            </RoomTypes>
                            <RatePlans>
                                <RatePlan RatePlanCode="{RATE_CODE}">
                                    <RatePlanDescription Name="{RATE_NAME}">
                                        <Text>{RATE_NAME}</Text>
                                    </RatePlanDescription>
                                </RatePlan>
                            </RatePlans>
                            <RoomRates>
                                <RoomRate RatePlanCode="{RATE_CODE}" RoomTypeCode="{ROOM_CODE}" NumberOfUnits="1">
                                    <Rates>
                                        <Rate UnitMultiplier="1" ExpireDate="2019-04-16" EffectiveDate="2019-04-14">
                                            <Base AmountAfterTax="500" CurrencyCode="THB"/>
                                            <Total AmountAfterTax="500" CurrencyCode="THB"/>
                                        </Rate>
                                    </Rates>
                                </RoomRate>
                            </RoomRates>
                            <GuestCounts>
                                <GuestCount AgeQualifyingCode="10" Count="2"/>
                            </GuestCounts>
                            <TimeSpan Start="2019-04-14" End="2019-04-16"/>
                            <Total AmountAfterTax="500" CurrencyCode="THB"/>
                            <BasicPropertyInfo HotelName="{HOTEL_NAME}" HotelCode="{HOTEL_CODE}"/>
                            <ResGuestRPHs>
                                <ResGuestRPH RPH="1"/>
                                <ResGuestRPH RPH="2"/>
                            </ResGuestRPHs>
                        </RoomStay>
                    </RoomStays>
                    <ResGuests>
                        <ResGuest ResGuestRPH="1">
                            <Profiles>
                                <ProfileInfo>
                                    <Profile ProfileType="1">
                                        <Customer>
                                            <PersonName>
                                                <GivenName>{CUSTOMER_GIVENNAME}</GivenName>
                                                <Surname>{CUSTOMER_SURNAME}</Surname>
                                            </PersonName>
                                        </Customer>
                                    </Profile>
                                </ProfileInfo>
                            </Profiles>
                        </ResGuest>
                        <ResGuest ResGuestRPH="2">
                            <Profiles>
                                <ProfileInfo>
                                    <Profile ProfileType="1">
                                        <Customer>
                                            <PersonName>
                                                <GivenName>{CUSTOMER_GIVENNAME}</GivenName>
                                                <Surname>{CUSTOMER_SURNAME}</Surname>
                                            </PersonName>
                                        </Customer>
                                    </Profile>
                                </ProfileInfo>
                            </Profiles>
                        </ResGuest>
                    </ResGuests>
                    <ResGlobalInfo>
                        <Total AmountAfterTax="1000" CurrencyCode="THB"/>
                        <HotelReservationIDs>
                            <HotelReservationID ResID_Type="14" ResID_Value="{RESERVATION_ID}"/>
                        </HotelReservationIDs>
                        <Profiles>
                            <ProfileInfo>
                                <Profile ProfileType="1">
                                    <Customer>
                                        <PersonName>
                                            <GivenName>{CUSTOMER_GIVENNAME}</GivenName>
                                            <Surname>{CUSTOMER_SURNAME}</Surname>
                                        </PersonName>
                                    </Customer>
                                </Profile>
                            </ProfileInfo>
                            <ProfileInfo>
                                <Profile ProfileType="4">
                                    <CompanyInfo>
                                        <CompanyName>{COMPANY_NAME}</CompanyName>
                                        <AddressInfo>
                                            <AddressLine>{COMPANY_ADDRESS}</AddressLine>
                                            <CityName>{COMPANY_CITY}</CityName>
                                            <PostalCode>{COMPANY_POSTAL_CODE}</PostalCode>
                                            <StateProv>{COMPANY_STATE}</StateProv>
                                            <CountryName Code="{COMPANY_COUNTRY_CODE}">{COMPANY_COUNTRY_NAME}</CountryName>
                                        </AddressInfo>
                                        <TelephoneInfo PhoneNumber="{COMPANY_PHONENUMBER}"/>
                                        <Email>{COMPANY_EMAIL}</Email>
                                    </CompanyInfo>
                                </Profile>
                            </ProfileInfo>
                        </Profiles>
                    </ResGlobalInfo>
                </HotelReservation>
            </HotelReservations>
        </OTA_HotelResNotifRQ>
    </s:Body>
</s:Envelope>